In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({1: [2,3,4], 2: [2,4,5]})

In [3]:
df

   1  2
0  2  2
1  3  4
2  4  5

In [4]:
df[2]

0    2
1    4
2    5
Name: 2, dtype: int64

In [5]:
df[2].replace(4, 17)

0     2
1    17
2     5
Name: 2, dtype: int64

In [6]:
df[2].replace(4, 17, inplace=True)

In [7]:
df

   1   2
0  2   2
1  3  17
2  4   5

In [ ]:
df.replace(2, 0)

In [ ]:
#print df.replace(r'\s+', np.nan, regex=True)